InformationRegisters/НастройкиИнтеграцииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗавершитьПереходВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииЦентраЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ИдентификаторЭДО - См. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.ИдентификаторЭДО
// 
// Возвращаемое значение:
//  См. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО
Функция УчетнаяЗаписьЦентраЭДО(ИдентификаторЭДО) Экспорт
	
	ИдентификаторыЭДО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЭДО);
	УчетныеЗаписиЦентровЭДО = УчетныеЗаписиЦентровЭДО(ИдентификаторыЭДО);
	Если ЗначениеЗаполнено(УчетныеЗаписиЦентровЭДО) Тогда
		Возврат УчетныеЗаписиЦентровЭДО[0];
	Иначе
		Возврат Справочники.УчетныеЗаписиЦентровЭДО.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Параметры:
//  ИдентификаторыЭДО - Неопределено
//                    - Массив из см. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.ИдентификаторЭДО
// 
// Возвращаемое значение:
//  Массив из см. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО
Функция УчетныеЗаписиЦентровЭДО(ИдентификаторыЭДО = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	НастройкиЦентраЭДО.УчетнаяЗаписьЦентраЭДО
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииЦентраЭДО КАК НастройкиЦентраЭДО";
		
	Если ИдентификаторыЭДО <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	НастройкиЦентраЭДО.ИдентификаторЭДО В (&ИдентификаторыЭДО)";
		Запрос.УстановитьПараметр("ИдентификаторыЭДО", ИдентификаторыЭДО);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("УчетнаяЗаписьЦентраЭДО");
	
КонецФункции

// Параметры:
//  РеквизитыОрганизации - см. ИнтеграцияЭДО.НовыеКлючевыеРеквизитыУчастникаЭДО
// 
// Возвращаемое значение:
//  Массив из см. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО
Функция УчетныеЗаписиЦентровЭДОПоРеквизитамОрганизации(РеквизитыОрганизации) Экспорт
	
	Результат = Новый Массив; // См. УчетныеЗаписиЦентровЭДОПоРеквизитамОрганизации
	
	Организация = ИнтеграцияЭДО.ОрганизацияПоКлючевымРеквизитам(РеквизитыОрганизации);
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторыЭДО = УчетныеЗаписиЭДО.ИдентификаторыЭДОПоОрганизации(Организация, Истина);
	
	Возврат УчетныеЗаписиЦентровЭДО(ИдентификаторыЭДО);
	
КонецФункции

// Параметры:
//  ИдентификаторыЭДО - Массив из см. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.ИдентификаторЭДО
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - См. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.ИдентификаторЭДО
//  * Значение - См. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО
Функция УчетныеЗаписиПоИдентификаторамЭДО(ИдентификаторыЭДО) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиЦентраЭДО.ИдентификаторЭДО,
		|	НастройкиЦентраЭДО.УчетнаяЗаписьЦентраЭДО
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииЦентраЭДО КАК НастройкиЦентраЭДО
		|ГДЕ
		|	НастройкиЦентраЭДО.ИдентификаторЭДО В (&ИдентификаторыЭДО)";
	Запрос.УстановитьПараметр("ИдентификаторыЭДО", ИдентификаторыЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторЭДО, Выборка.УчетнаяЗаписьЦентраЭДО);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - См. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.ИдентификаторЭДО
//  УчетнаяЗаписьЦентраЭДО - См. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО
//  ТребуетсяЗавершитьПереходВЦентрЭДО - Булево
Процедура Записать(ИдентификаторЭДО, УчетнаяЗаписьЦентраЭДО, ТребуетсяЗавершитьПереходВЦентрЭДО = Ложь) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
	ЗаписьНабора.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
	ЗаписьНабора.ТребуетсяЗавершитьПереходВЦентрЭДО = ТребуетсяЗавершитьПереходВЦентрЭДО;
	НаборЗаписей.Записать();
КонецПроцедуры

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - См. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО
// 
// Возвращаемое значение:
//  Массив из Строка
Функция ИдентификаторыЭДОУчетнойЗаписи(УчетнаяЗаписьЦентраЭДО) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	НастройкиЦентраЭДО.ИдентификаторЭДО
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииЦентраЭДО КАК НастройкиЦентраЭДО
		|ГДЕ
		|	НастройкиЦентраЭДО.УчетнаяЗаписьЦентраЭДО = &УчетнаяЗаписьЦентраЭДО";
	Запрос.УстановитьПараметр("УчетнаяЗаписьЦентраЭДО", УчетнаяЗаписьЦентраЭДО);
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИдентификаторЭДО");
КонецФункции

// Параметры:
//  УчетныеЗаписиЦентровЭДО - Неопределено
//                         - Массив из СправочникСсылка.УчетныеЗаписиЦентровЭДО.
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * Значение - Массив из Строка
Функция ИдентификаторыЭДОПоУчетнымЗаписям(УчетныеЗаписиЦентровЭДО = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиЦентраЭДО.ИдентификаторЭДО,
		|	НастройкиЦентраЭДО.УчетнаяЗаписьЦентраЭДО
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииЦентраЭДО КАК НастройкиЦентраЭДО";
	
	Если УчетныеЗаписиЦентровЭДО <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	НастройкиЦентраЭДО.УчетнаяЗаписьЦентраЭДО В (&УчетныеЗаписиЦентровЭДО)";
		Запрос.УстановитьПараметр("УчетныеЗаписиЦентровЭДО", УчетныеЗаписиЦентровЭДО);
	КонецЕсли;
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторыЭДО = Результат[Выборка.УчетнаяЗаписьЦентраЭДО];
		Если ИдентификаторыЭДО = Неопределено Тогда
			ИдентификаторыЭДО = Новый Массив; // Массив из Строка
			Результат.Вставить(Выборка.УчетнаяЗаписьЦентраЭДО, ИдентификаторыЭДО);
		КонецЕсли;
		ИдентификаторыЭДО.Добавить(Выборка.ИдентификаторЭДО);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - См. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.ИдентификаторЭДО
Процедура Удалить(ИдентификаторЭДО) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Записать();
КонецПроцедуры

// Параметры:
//  ИдентификаторыЭДО - Массив из см. РегистрСведений.НастройкиИнтеграцииЦентраЭДО.ИдентификаторЭДО
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * Значение - Массив из Строка
Функция СгруппироватьПоУчетнымЗаписям(ИдентификаторыЭДО) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиЦентраЭДО.ИдентификаторЭДО,
		|	НастройкиЦентраЭДО.УчетнаяЗаписьЦентраЭДО
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииЦентраЭДО КАК НастройкиЦентраЭДО
		|ГДЕ
		|	НастройкиЦентраЭДО.ИдентификаторЭДО В (&ИдентификаторыЭДО)";
	Запрос.УстановитьПараметр("ИдентификаторыЭДО", ИдентификаторыЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторыЭДОПоУчетнойЗаписиСервиса = Результат[Выборка.УчетнаяЗаписьЦентраЭДО]; // Массив из Строка
		Если ИдентификаторыЭДОПоУчетнойЗаписиСервиса = Неопределено Тогда
			ИдентификаторыЭДОПоУчетнойЗаписиСервиса = Новый Массив; // Массив из Строка
			Результат.Вставить(Выборка.УчетнаяЗаписьЦентраЭДО, ИдентификаторыЭДОПоУчетнойЗаписиСервиса);
		КонецЕсли;
		ИдентификаторыЭДОПоУчетнойЗаписиСервиса.Добавить(Выборка.ИдентификаторЭДО);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Неопределено,Структура:
//  * УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * ТребуетсяЗавершитьПереходВЦентрЭДО - Булево
Функция НайтиПоИдентификаторуЭДО(ИдентификаторЭДО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиЦентраЭДО.УчетнаяЗаписьЦентраЭДО,
		|	НастройкиЦентраЭДО.ТребуетсяЗавершитьПереходВЦентрЭДО
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииЦентраЭДО КАК НастройкиЦентраЭДО
		|ГДЕ
		|	НастройкиЦентраЭДО.ИдентификаторЭДО = &ИдентификаторЭДО";
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Настройка = Новый Структура;
	Настройка.Вставить("УчетнаяЗаписьЦентраЭДО", Выборка.УчетнаяЗаписьЦентраЭДО);
	Настройка.Вставить("ТребуетсяЗавершитьПереходВЦентрЭДО", Выборка.ТребуетсяЗавершитьПереходВЦентрЭДО);
	
	Возврат Настройка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
